var Homedics = function() {
};

Homedics.transMap = {
  'a': 'あ', 'i': 'い', 'u': 'う', 'e': 'え', 'o': 'お',
  'k': { 'ka': 'か', 'ki': 'き', 'ku': 'く', 'ke': 'け', 'ko': 'こ' },
  's': { 'sa': 'さ', 'si': 'し', 'su': 'す', 'se': 'せ', 'so': 'そ' },
  't': { 'ta': 'た', 'ti': 'ち', 'tu': 'つ', 'te': 'て', 'to': 'と' },
  'n': { 'na': 'な', 'ni': 'に', 'nu': 'ぬ', 'ne': 'ね', 'no': 'の' },
  'h': { 'ha': 'は', 'hi': 'ひ', 'hu': 'ふ', 'he': 'へ', 'ho': 'ほ' },
  'm': { 'ma': 'ま', 'mi': 'み', 'mu': 'む', 'me': 'め', 'mo': 'も' },
  'y': { 'ya': 'や', 'yu': 'ゆ', 'yo': 'よ' },
  'r': { 'ra': 'ら', 'ri': 'り', 'ru': 'る', 're': 'れ', 'ro': 'ろ' },
  'w': { 'wa': 'わ', 'wo': 'を' },
  'n': 'ん',
  'g': { 'ga': 'が', 'gi': 'ぎ', 'gu': 'ぐ', 'ge': 'げ', 'go': 'ご' },
  'z': { 'za': 'ざ', 'zi': 'じ', 'zu': 'ず', 'ze': 'ぜ', 'zo': 'ぞ' },
  'j': { 'ja': 'じゃ', 'ji': 'じ', 'ju': 'じゅ', 'je': 'じぇ', 'jo': 'じょ' },
  'd': { 'da': 'だ', 'di': 'ぢ', 'du': 'づ', 'de': 'で', 'do': 'ど' },
  'b': { 'ba': 'ば', 'bi': 'び', 'bu': 'ぶ', 'be': 'べ', 'bo': 'ぼ' },
  'p': { 'pa': 'ぱ', 'pi': 'ぴ', 'pu': 'ぷ', 'pe': 'ぺ', 'po': 'ぽ' }
};

Homedics.prototype.match = function(str) {
};
